Autodesk.Revit.DB.FormaRoadPolylineClampGroup.GetPolylines
Since:
2027

Autodesk.Revit.DB.FormaRoadPolylineClampGroup.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormaRoadPolylineClampGroup.#ctor(Autodesk.Revit.DB.FormaRoadPolylineClampGroup)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoadPolylineClampGroup.#ctor(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.UV}},Autodesk.Revit.DB.FormaTriangleMesh)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoadPolylineClampGroup
One clamped road surface mesh and the open polylines to drape onto it.
Non-owning reference to the target surface. The mesh is owned by the caller (e.g. the
OwnerArr returned by clampRegionsToTerrain) and must outlive this group, which only lives
for the duration of the clampPolylinesToClampedMeshes call.
Since:
2027